import random

dow_th = {
	1: "วันจันทร์",
	2: "วันอังคาร",
	3: "วันพุธ",
	4: random.choice(["วันพฤหัสบดี", "วันพฤหัส"]),
	5: "วันศุกร์",
	6: "วันเสาร์",
	7: "วันอาทิตย์",
}


__greet_a =	[
	"สวัสดี",
	"อรุณสวัสดิ์",
	"สุขสันต์"
]
__greet_b = [
	"",
	" เช้า",
	"ยามเช้า"
]
greetings = random.choice(__greet_a) + random.choice(__greet_b)


__bless_verb = [
	""
	"ขอให้",
]
__bless_object = [
	"มีความสุข",
	"สุขกาย สุขใจ",
	"สบายกาย สบายใจ",
	"มีชีวิตชีวา แจ่มใส",
	"สดชื่น แจ่มใส",
	"เฮงๆ ร่ำรวย",
	"โชคดี มีความสุข",
	"โชคดี มีชัย แจ่มใส",
	"คิดสิ่งใด ให้สมปรารถนา",
	"มั่งมีศรีสุข",
	"แสนสดใส",
	"ร่างกายแข็งแรง",
	"จิตใจผ่องใส",
	"สุขภาพแข็งแรง",
	"ปลอดโรคภัย",
]
blessings = random.choice(__bless_verb) + random.choice(__bless_object)
